In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Salarios
df = pd.read_csv('http://www.ppgia.pucpr.br/~jean.barddal/datascience/Salaries.csv')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     397 non-null    int64
 1   rank           397 non-null    object
 2   discipline     397 non-null    object
 3   yrs.since.phd  397 non-null    int64
 4   yrs.service    397 non-null    int64
 5   sex            397 non-null    object
 6   salary         397 non-null    int64
dtypes: int64(4), object(3)
memory usage: 21.8+ KB

In [ ]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [ ]:
# Apagando uma coluna (axis=1 é pra remover 1 COLUNA, axis=0 remove a LINHA)
df2 = df.drop("Unnamed: 0", axis=1)
df2.head(15)

         rank discipline  yrs.since.phd  yrs.service     sex  salary
0        Prof          B             19           18    Male  139750
1        Prof          B             20           16    Male  173200
2    AsstProf          B              4            3    Male   79750
3        Prof          B             45           39    Male  115000
4        Prof          B             40           41    Male  141500
5   AssocProf          B              6            6    Male   97000
6        Prof          B             30           23    Male  175000
7        Prof          B             45           45    Male  147765
8        Prof          B             21           20    Male  119250
9        Prof          B             18           18  Female  129000
10  AssocProf          B             12            8    Male  119800
11   AsstProf          B              7            2    Male   79800
12   AsstProf          B              1            1    Male   77700
13   AsstProf          B              2            0    Male   78000
14       Prof          B             20           18    Male  104800

In [ ]:
df2[['sex', 'salary']]

      sex  salary
0    Male  139750
1    Male  173200
2    Male   79750
3    Male  115000
4    Male  141500
..    ...     ...
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

[397 rows x 2 columns]

In [ ]:
# Selecao condicional (composta -> E (&), OU (|), NOT (~))

# Exemplo: selecionando professoras da disciplina A

condicao = (df['discipline'] == 'A') & (df['sex'] == 'Female')
df[condicao]

     Unnamed: 0       rank discipline  ...  yrs.service     sex  salary
19           20       Prof          A  ...           36  Female  137000
24           25  AssocProf          A  ...            8  Female   74830
114         115       Prof          A  ...            0  Female  105000
119         120   AsstProf          A  ...            3  Female   73500
123         124  AssocProf          A  ...           22  Female   62884
127         128   AsstProf          A  ...            0  Female   72500
132         133  AssocProf          A  ...            8  Female   77500
133         134   AsstProf          A  ...            1  Female   72500
230         231       Prof          A  ...           27  Female   91000
231         232  AssocProf          A  ...           24  Female   73300
233         234       Prof          A  ...           19  Female  117555
237         238   AsstProf          A  ...            6  Female   63100
245         246       Prof          A  ...           11  Female   90450
253         254   AsstProf          A  ...            2  Female   77500
254         255       Prof          A  ...            7  Female  116450
274         275   AsstProf          A  ...            3  Female   78500
358         359       Prof          A  ...           14  Female  109954
361         362       Prof          A  ...           15  Female  109646

[18 rows x 7 columns]

In [ ]:
# Selecionando uma celula especifica (indice de linha e de coluna)
# Obtendo a linha 133 e a coluna sex
df.loc[133]['sex']

'Female'

In [ ]:
# Calcular o salario medio das professoras da disciplina B
# condicao (sexo feminino e disciplina B)

#df[(df['sex'] == 'Female') & (df['discipline'] == 'B')]['salary'].mean()
print(f"Female: {df[(df['sex'] == 'female')]['salary'].mean()}")
print(f"Male: {df[(df['sex'] == 'male')]['salary'].mean()}")

# Group By
df.groupby('sex')['salary'].mean()

Female: nan
Male: nan

sex
Female    101002.410256
Male      115090.418994
Name: salary, dtype: float64

In [ ]:
# Ordenacao
df.sort_values(['discipline', 'salary'], ascending=[True, False])

     Unnamed: 0       rank discipline  ...  yrs.service     sex  salary
364         365       Prof          A  ...           43    Male  205500
249         250       Prof          A  ...            7    Male  204000
271         272       Prof          A  ...           18    Male  194800
389         390       Prof          A  ...           18    Male  186023
292         293       Prof          A  ...            9    Male  183800
..          ...        ...        ...  ...          ...     ...     ...
75           76   AsstProf          B  ...            3    Male   73266
316         317  AssocProf          B  ...            9  Female   71065
49           50   AsstProf          B  ...            1    Male   70768
64           65   AsstProf          B  ...            3    Male   68404
317         318       Prof          B  ...           45    Male   67559

[397 rows x 7 columns]

In [ ]:
# Mediana
df['salary'].median()

107300.0

In [ ]:
# Moda
df[['salary', 'sex']].mode()

   salary   sex
0   92000  Male

In [ ]:
# Salario médio e quantidade na mesma tabela
df.groupby('sex')['salary'].agg(['mean', 'count'])

                 mean  count
sex
Female  101002.410256     39
Male    115090.418994    358

In [ ]:
# applymap (aplica uma funcao em cada celula da tabela)
df = df.applymap(lambda s: s.lower() if type(s) == str else s)

In [ ]:
df.head(5)

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      prof          b             19           18  male  139750
1           2      prof          b             20           16  male  173200
2           3  asstprof          b              4            3  male   79750
3           4      prof          b             45           39  male  115000
4           5      prof          b             40           41  male  141500

In [ ]:
# Construção de novas features (colunas/variáveis/atributos)
# Feature engineering

In [ ]:
# Criar uma coluna nova baseado em calculo sobre colunas existentes
# dif doutorado e trabalho = yrs.since.phd - yrs.service
df['dif_doutorado_trabalho'] = df['yrs.since.phd'] - df['yrs.service']

In [ ]:
df.head(5)

   Unnamed: 0      rank discipline  ...   sex  salary dif_doutorado_trabalho
0           1      prof          b  ...  male  139750                      1
1           2      prof          b  ...  male  173200                      4
2           3  asstprof          b  ...  male   79750                      1
3           4      prof          b  ...  male  115000                      6
4           5      prof          b  ...  male  141500                     -1

[5 rows x 8 columns]

In [ ]:
# Verdadeiro se o sexo == MALE and salary > 150000
def tratamento_duas_colunas(r):
  return r['salary'] > 150000 and r['sex'] == 'male'

df['condicao_com_duas_colunas'] = df.apply(tratamento_duas_colunas, axis=1)
# axis = 1 significa que a função recebe cada linha individualmente
# desta forma, a função deve tratar a linha e não a celula (como era no apply normal)

In [ ]:
df.head(5)

   Unnamed: 0      rank  ... dif_doutorado_trabalho  condicao_com_duas_colunas
0           1      prof  ...                      1                      False
1           2      prof  ...                      4                       True
2           3  asstprof  ...                      1                      False
3           4      prof  ...                      6                      False
4           5      prof  ...                     -1                      False

[5 rows x 9 columns]

In [ ]:
df.groupby('discipline')['salary'].mean()

discipline
a    108548.430939
b    118028.694444
Name: salary, dtype: float64

In [ ]:
df[(df['discipline'] == 'B') & (df['yrs.since.phd'] < 5) & (df['sex'] == 'Male')]['salary'].agg(['mean', 'count'])

mean     NaN
count    0.0
Name: salary, dtype: float64

In [ ]:
#Analisar simetria e curtose da variavel de salario
df.kurt()

Unnamed: 0                  -1.200000
yrs.since.phd               -0.794417
yrs.service                 -0.311423
salary                       0.215350
dif_doutorado_trabalho       2.232386
condicao_com_duas_colunas    2.836008
dtype: float64

In [ ]:
df.skew()

Unnamed: 0                   0.000000
yrs.since.phd                0.300880
yrs.service                  0.650569
salary                       0.714568
dif_doutorado_trabalho       1.316717
condicao_com_duas_colunas    2.195847
dtype: float64